Revit 2026 API

# ElectricalAnalyticalNodeGetAnalyticalPropertyData Method

---

Gets the electrical analytical node property data,  if not available.

**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public AnalyticalDistributionNodePropertyData GetAnalyticalPropertyData()
```
```vb
Public Function GetAnalyticalPropertyData As AnalyticalDistributionNodePropertyData
```
```cpp
public:
AnalyticalDistributionNodePropertyData^ GetAnalyticalPropertyData()
```
```fsharp
member GetAnalyticalPropertyData : unit -> AnalyticalDistributionNodePropertyData
```

#### Return Value

AnalyticalDistributionNodePropertyData The electrical analytical node property data.

These types have special data:

  * Bus
  * TransferSwitch
  * EquipmentLoad

#### Reference

ElectricalAnalyticalNode Class

Autodesk.Revit.DB.Electrical Namespace